seojuwon/work_nrf52_bt_speed_change/examples/ble_peripheral/ble_app_uart/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            //if ((data_array[index - 1] == '\n') ||
            if ( (data_array[index - 1] == '\r') || (index >= m_ble_nus_max_data_len))
            {
                if (index > 1)
                {
                    NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                    NRF_LOG_HEXDUMP_DEBUG(data_array, index);
					
					if(data_array[0]==0x55 && data_array[1]==0xAA && data_array[2]==0xEE)
					{
						save_buf.bd_save_name1[0]=data_array[3];//save_buf.bd_save_name1
						save_buf.bd_save_name1[1]=data_array[4];
						save_buf.bd_save_name1[2]=data_array[5];
						save_buf.bd_save_name1[3]=data_array[6];
						save_buf.bd_save_name2[0]=data_array[7];
						save_buf.bd_save_name2[1]=data_array[8];
						save_buf.bd_save_name2[2]=data_array[9];
						save_buf.bd_save_name2[3]=data_array[10];
						save_buf.bd_save_name3[0]=data_array[11];
						save_buf.bd_save_name3[1]=data_array[12];
						save_buf.bd_save_name3[2]=data_array[13];
						save_buf.bd_save_name3[3]=data_array[14];
						save_buf.bd_save_name_num[0]=data_array[15];
						save_buf.bd_save_name_num[1]=data_array[16];
						save_buf.bd_save_name_num[2]=data_array[17];
						save_buf.bd_save_name_num[3]=data_array[18];
						fds_write_flag=1;
						//nvm_total_save();
					}

                    do
                    {
                        uint16_t length = (uint16_t)index;
                        err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                        if ((err_code != NRF_ERROR_INVALID_STATE) &&
                            (err_code != NRF_ERROR_RESOURCES) &&
                            (err_code != NRF_ERROR_NOT_FOUND))
                        {
                            APP_ERROR_CHECK(err_code);
                        }
                    } while (err_code == NRF_ERROR_RESOURCES);
                }

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
          //  APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */
#define UICR_ADDRESS								0x10001084
static ble_gap_addr_t       m_my_addr;                                                              /**< Local GAP address. */

static void ble_addr_make(void)
{
		uint32_t               err_code;
		uint16_t major_value  = ((*(uint32_t *)UICR_ADDRESS) & 0xFFFF0000) >> 16;
		uint16_t minor_value  = ((*(uint32_t *)UICR_ADDRESS) & 0x0000FFFF);
		uint16_t add_value = ((*(uint32_t *)(UICR_ADDRESS+4)) & 0x0000FFFF);
		//SAVE_INFO_T move_buf[22];
		

		sd_ble_gap_addr_get(&m_my_addr);
	
	
		uint8_t addr_name = ((*(uint32_t *)0x76000) >> 0) &0x000000FF ;
		//if((major_value != 0xFFFF) && (minor_value != 0xFFFF))
		//printf("addr data %x \n", ((*(uint32_t *)0x76000) >> 0) &0x000000FF );
	
	
		memcpy(&save_buf, (uint8_t *)( 0x76000 ), sizeof(save_buf) ); // 3주치 데이터중 복사
	#if 0
		if( save_buf.bd_save_addr[0]==0xff && save_buf.bd_save_addr[1]==0xff && save_buf.bd_save_addr[2]==0xff && save_buf.bd_save_addr[3]==0xff )
		{
			
