seojuwon/work_nrf52_bt_speed_change/examples/ble_peripheral/ble_app_uart/main.c
		}
		else
		{
			err_code = sd_ble_gap_addr_get(&m_my_addr);
			APP_ERROR_CHECK(err_code);

			m_my_addr.addr[5]   = save_buf.bd_save_addr[5];
			m_my_addr.addr[4]   = save_buf.bd_save_addr[4];
			m_my_addr.addr[3] 	= save_buf.bd_save_addr[3];
			m_my_addr.addr[2] 	= save_buf.bd_save_addr[2];
			m_my_addr.addr[1] 	= save_buf.bd_save_addr[1];
			m_my_addr.addr[0] 	= save_buf.bd_save_addr[0];

			m_my_addr.addr_type = BLE_GAP_ADDR_TYPE_PUBLIC;

			err_code = sd_ble_gap_addr_set(&m_my_addr);
			APP_ERROR_CHECK(err_code);
		}
	
		NRF_LOG_INFO("[SET_BDADDR] %02X:%02X:%02X:%02X:%02X:%02X", 
													m_my_addr.addr[5], m_my_addr.addr[4], m_my_addr.addr[3], 
													m_my_addr.addr[2], m_my_addr.addr[1], m_my_addr.addr[0]);
	#endif
}


/**@brief Function for initializing the Advertising functionality.
 */
//static 
void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;
//ble_addr_make();
    memset(&init, 0, sizeof(init));

	#if 1 // 무제한 Fast mode
		  init.advdata.name_type          = BLE_ADVDATA_FULL_NAME; //by seo
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
	
	
	memcpy(&save_buf, (uint8_t *)( 0x76000 ), sizeof(save_buf) ); // 3주치 데이터중 복사
	
	uint32_t calc_adv_speed=64;
	if( (save_buf.bd_save_name_num[1]==0xff) || (save_buf.bd_save_name_num[1]==0x00) )
	{
		calc_adv_speed=64;
	}
	else if( save_buf.bd_save_name_num[1]==0x01 ) // ms
	{
		calc_adv_speed=save_buf.bd_save_name_num[2];
		calc_adv_speed= ((save_buf.bd_save_name_num[2]-48)*100) + ((save_buf.bd_save_name_num[3]-48)*10) ;
		calc_adv_speed= calc_adv_speed/0.625;
		if(calc_adv_speed<64)
		{
			calc_adv_speed=64;
		}
	}
	else if( save_buf.bd_save_name_num[1]==0x02 ) // s
	{
		calc_adv_speed=save_buf.bd_save_name_num[2];
		calc_adv_speed= ((save_buf.bd_save_name_num[2]-48)*10000) + ((save_buf.bd_save_name_num[3]-48)*1000) ;
		calc_adv_speed= calc_adv_speed/0.625;
		if(calc_adv_speed<64)
		{
			calc_adv_speed=64;
		}
	}
	//printf("calc_adv_speed =%d %d %d  %d", save_buf.bd_save_name_num[1],save_buf.bd_save_name_num[2],save_buf.bd_save_name_num[3], calc_adv_speed);
	
		
	//init.config.ble_adv_fast_interval = 64; // 40ms //APP_ADV_INTERVAL;  0.625x64=40ms
	
	init.config.ble_adv_fast_interval = calc_adv_speed;
    //init.config.ble_adv_fast_interval = 640*2; // 1000ms //APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = 0; //ms APP_ADV_DURATION;  20sec
		
	#else // Fast -> Slow -> Idle
    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME; //by seo
    init.advdata.include_appearance = false;
		init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = 64; //40ms //APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = 300; //   100*20; //APP_ADV_DURATION;  20sec //1sec=100

		init.config.ble_adv_slow_enabled  = true;
    init.config.ble_adv_slow_interval = 64*10; //40ms //APP_ADV_INTERVAL;  
		init.config.ble_adv_slow_timeout  = 200; // 100*180; //1sec=100  max 180sec //3min 30sec
	#endif
	
	
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
		
		sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_advertising.adv_handle, 0); 
	//* @note Supported tx_power values: -40dBm, -20dBm, -16dBm, -12dBm, -8dBm, -4dBm, 0dBm, +3dBm and +4dBm.
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
APP_TIMER_DEF(led_test_1);  //timer test

int main(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
		app_uart_put('s');
		app_uart_put('t');
		app_uart_put('a');
		app_uart_put('r');
		app_uart_put('t');
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

app_timer_create(&led_test_1, APP_TIMER_MODE_REPEATED, led_test_1_handler); 
			//app_timer_start(led_test_1, APP_TIMER_TICKS(200), NULL);  //ms 
			//app_timer_stop(led_test_1);
	#if 0
	printf("addr data %x \n", ((*(uint32_t *)0x76000)  & 0xFFFF0000) >> 16);
	printf("addr data %x \n", ((*(uint32_t *)0x76000) >> 0) &0x000000FF );
	printf("addr data %x \n", ((*(uint32_t *)0x76000) >> 8) &0x000000FF );
	printf("addr data %x \n", ((*(uint32_t *)0x76000) >> 16) &0x000000FF );
	printf("addr data %x \n", ((*(uint32_t *)0x76000) >> 24) &0x000000FF );
	#endif
    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
		if(fds_write_flag==1)
		{
			nvm_total_save();
			fds_write_flag = 0;
		}
					
    }
}


void led_test_1_handler(void * p_context) //user timer  example - 1ms timer (init -> create -> start -> handler)
{
    UNUSED_PARAMETER(p_context);
		app_timer_stop(led_test_1);
		
		app_uart_put('s');
		app_uart_put('t');
		
		app_timer_start(led_test_1, APP_TIMER_TICKS(200), NULL);  //ms 
		
}

/**
 * @}
 */
